// Напишите метод printEvenNums, который выведет на экран все четные числа
//в промежутке от 1 до 100, каждое на новой строке
public class Answer1 {
    
    public static void printEvenNums() {
        // Напишите свое решение н
        for ( int i = 1; i <= 100; i++) {
            if (i % 2 == 0) {
                System.out.println(i);       
            }
        
        }   
    }
}    
       

